app/views/uses/_form.html.slim

SELECT "uses".* FROM "uses" WHERE "uses"."car_id" = $1 ORDER BY "uses"."id" ASC LIMIT $2  [["car_id", 59], ["LIMIT", 1]]
---
      - if @use.id
        - if @use.id == @car.uses.order(:id).first.id

SELECT "uses".* FROM "uses" WHERE "uses"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT COUNT(*) FROM "uses" WHERE "uses"."car_id" = $1  [["car_id", 56]]
---
        - else
          | (ひとつ前 #{@car.uses.where('id < ?', @use.id).order(:id).last.odometer})
      - else
        - if @car.uses.count > 0