app/views/uses/index.html.slim

      - @uses.each do |use|
        - last_use = @car.uses.where("id < #{use.id}").order(:id).last
---
SELECT "uses".* FROM "uses" WHERE "uses"."car_id" = $1 ORDER BY "uses"."created_at" DESC  [["car_id", 55]]