app/controllers/admin/companies_controller.rb

  def index
    @company = Company.all
---
SELECT "companies".* FROM "companies"

  def create
    @company = Company.new(company_params)
    if @company.save
---
INSERT INTO "companies" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "OurCars51株式会社"], ["created_at", "2020-07-17 16:15:14.473572"], ["updated_at", "2020-07-17 16:15:14.473572"]]

  def update
    if @company.update(company_params)
---
UPDATE "companies" SET "name" = $1, "updated_at" = $2 WHERE "companies"."id" = $3  [["name", "OurCaaaars株式会社"], ["updated_at", "2020-07-17 16:15:14.642869"], ["id", 54]]