app/controllers/admin/managers_controller.rb

INSERT INTO "managers" ("email", "encrypted_password", "manager_name", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @manager = @company.managers.build(manager_params)
    if @manager.save

UPDATE "managers" SET "manager_name" = $1, "updated_at" = $2 WHERE "managers"."id" = $3  [["manager_name", "鈴木二郎"], ["updated_at", "2020-07-17 16:15:15.752541"], ["id", 26]]
---
  def update
    if @manager.update(manager_params)

DELETE FROM "managers" WHERE "managers"."id" = $1  [["id", 29]]
---
  def destroy
    @manager.destroy

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 74], ["LIMIT", 1]]
---
    def set_company
      @company = Company.find(params[:company_id])

SELECT "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
---
    def set_manager
      @manager = Manager.find(params[:id])