app/controllers/manager/cards_controller.rb

UPDATE "cards" SET "number" = $1, "updated_at" = $2 WHERE "cards"."id" = $3  [["number", 1], ["updated_at", "2020-07-17 16:15:12.479419"], ["id", 2]]
---
  def update
    if @card.update(card_params)

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
    def set_user_and_company
      @company = Company.find(params[:company_id])
      @user = User.find(params[:user_id])

SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_card
      @card = Card.find(params[:id])