app/controllers/manager/cars_controller.rb

  def index
    @cars = @company.cars.order(created_at: :desc)
---
SELECT "cars".* FROM "cars" WHERE "cars"."company_id" = $1 ORDER BY "cars"."created_at" DESC  [["company_id", 41]]

  def monthly_report
    @cars = @company.cars.order(created_at: :desc)
---
SELECT "cars".* FROM "cars" WHERE "cars"."company_id" = $1 ORDER BY "cars"."created_at" DESC  [["company_id", 1]]

  def create
    @car = @company.cars.build(car_params)
    if @car.save
---
INSERT INTO "cars" ("car_name", "number", "tank", "oil_frequency", "initial_odometer", "company_id", "created_at", "updated_at", "state", "borrower", "purchase_day", "region", "parking", "initial_mileage") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"

  def update
    if @car.update(car_params)
---
UPDATE "cars" SET "car_name" = $1, "updated_at" = $2 WHERE "cars"."id" = $3  [["car_name", "アクア"], ["updated_at", "2020-07-17 16:15:13.728791"], ["id", 20]]

    def set_company
      @company = Company.find(params[:company_id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]