app/controllers/manager/inspections_controller.rb

SELECT "inspections".* FROM "inspections" WHERE "inspections"."car_id" = $1 ORDER BY "inspections"."created_at" DESC  [["car_id", 24]]
---
  def index
    @inspections = @car.inspections.order(created_at: :desc)

INSERT INTO "inspections" ("fee", "limit", "car_id", "created_at", "updated_at", "start_day", "end_day", "inspection_memo") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @inspection = @car.inspections.build(inspection_params)
    if @inspection.save

UPDATE "inspections" SET "fee" = $1, "updated_at" = $2 WHERE "inspections"."id" = $3  [["fee", 100000], ["updated_at", "2020-07-17 16:15:15.197806"], ["id", 3]]
---
  def update
    if @inspection.update(inspection_params)

DELETE FROM "inspections" WHERE "inspections"."id" = $1  [["id", 6]]
---
  def destroy
    @inspection.destroy

SELECT "inspections".* FROM "inspections" WHERE "inspections"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_inspection
      @inspection = Inspection.find(params[:id])

SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
---
    def set_company_and_car
      @company = current_manager.company
      @car = Car.find(params[:car_id])