app/controllers/manager/managers_controller.rb

  def create
    @manager = @company.managers.build(manager_params)
    if @manager.save
---
INSERT INTO "managers" ("email", "encrypted_password", "manager_name", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if @manager.update(manager_params)
---
UPDATE "managers" SET "manager_name" = $1, "updated_at" = $2 WHERE "managers"."id" = $3  [["manager_name", "鈴木二郎"], ["updated_at", "2020-07-17 16:15:16.215445"], ["id", 38]]

  def destroy
    if @company.managers.count == 1
      redirect_to company_manager_managers_path, notice: '管理ユーザーを0人にすることはできません。'
    else
      @manager.destroy
---
SELECT COUNT(*) FROM "managers" WHERE "managers"."company_id" = $1  [["company_id", 83]]
DELETE FROM "managers" WHERE "managers"."id" = $1  [["id", 44]]

    def set_company
      @company = Company.find(params[:company_id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 83], ["LIMIT", 1]]

    def set_manager
      @manager = Manager.find(params[:id])
---
SELECT "managers".* FROM "managers" WHERE "managers"."id" = $1 ORDER BY "managers"."id" ASC LIMIT $2  [["id", 45], ["LIMIT", 1]]