app/controllers/manager/memos_controller.rb

SELECT "memos".* FROM "memos" WHERE "memos"."car_id" = $1 ORDER BY "memos"."created_at" DESC  [["car_id", 33]]
---
  def index
    @memos = @car.memos.order(created_at: :desc)

INSERT INTO "memos" ("content", "memo_day", "car_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "タイヤ交換"], ["memo_day", "2020-06-19"], ["car_id", 35], ["created_at", "2020-07-17 16:15:16.641082"], ["updated_at", "2020-07-17 16:15:16.641082"]]
---
  def create
    @memo = @car.memos.build(memo_params)
    if @memo.save

UPDATE "memos" SET "content" = $1, "updated_at" = $2 WHERE "memos"."id" = $3  [["content", "ワイパー交換"], ["updated_at", "2020-07-17 16:15:16.814529"], ["id", 3]]
---
  def update
    if @memo.update(memo_params)

DELETE FROM "memos" WHERE "memos"."id" = $1  [["id", 6]]
---
  def destroy
    @memo.destroy

SELECT "memos".* FROM "memos" WHERE "memos"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def set_memo
      @memo = Memo.find(params[:id])

SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
---
    def set_company_and_car
      @company = current_manager.company
      @car = Car.find(params[:car_id])