app/controllers/manager/users_controller.rb

  def create
    @user = @company.users.build(user_params)
    if @user.save
      card = @user.build_card(number: 0)
      card.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "company_id", "user_name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "cards" ("number", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["number", 0], ["user_id", 29], ["created_at", "2020-07-17 16:15:17.564567"], ["updated_at", "2020-07-17 16:15:17.564567"]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "user_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["user_name", "鈴木二郎"], ["updated_at", "2020-07-17 16:15:17.737101"], ["id", 32]]

    def set_company
      @company = Company.find(params[:company_id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 109], ["LIMIT", 1]]