app/controllers/manager/uses_controller.rb

SELECT "uses".* FROM "uses" WHERE "uses"."car_id" = $1 ORDER BY "uses"."created_at" DESC  [["car_id", 48]]
---
  def index
    @uses = @car.uses.order(created_at: :desc)

INSERT INTO "uses" ("use_day", "odometer", "destination", "refueling_amount", "wash", "oil_change", "user_id", "car_id", "created_at", "updated_at", "inspection_st", "self_inspection") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
SELECT "uses".* FROM "uses" WHERE "uses"."car_id" = $1 ORDER BY "uses"."id" ASC LIMIT $2  [["car_id", 50], ["LIMIT", 1]]
UPDATE "uses" SET "updated_at" = $1, "distance" = $2 WHERE "uses"."id" = $3  [["updated_at", "2020-07-17 16:15:18.139214"], ["distance", 70], ["id", 11]]
SELECT COUNT(*) FROM "uses" WHERE "uses"."car_id" = $1 AND "uses"."refueling_amount" != $2  [["car_id", 50], ["refueling_amount", 0.0]]
---
  def create
    @use = @car.uses.build(use_params)
    if @use.inspection_st == '車検依頼'
      @car.update(state: '車検中')
    else
      @car.update(state: '空車')
    end
    if @use.save
      if @use.id > @car.uses.order(:id).first.id
        @use.update(distance: @use.odometer - @car.uses.where("id < #{@use.id}").order(:id).last.odometer)
      else
        @use.update(distance: @use.odometer - @car.initial_odometer)
      end
      if @car.uses.where.not(refueling_amount: 0).count >=2

UPDATE "uses" SET "destination" = $1, "updated_at" = $2 WHERE "uses"."id" = $3  [["destination", "中央区役所"], ["updated_at", "2020-07-17 16:15:18.381503"], ["id", 13]]
SELECT "uses".* FROM "uses" WHERE "uses"."car_id" = $1 ORDER BY "uses"."id" ASC LIMIT $2  [["car_id", 53], ["LIMIT", 1]]
SELECT "uses".* FROM "uses" WHERE "uses"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT COUNT(*) FROM "uses" WHERE "uses"."car_id" = $1 AND "uses"."refueling_amount" != $2  [["car_id", 53], ["refueling_amount", 0.0]]
---
  def update
    if @use.update(use_params)
      if @use.inspection_st == '車検依頼'
        @car.update(state: '車検中')
      else
        @car.update(state: '空車')
      end
      if @use.id > @car.uses.order(:id).first.id
        @use.update(distance: @use.odometer - @car.uses.where("id < #{@use.id}").last.odometer)
      else
        @use.update(distance: @use.odometer - @car.initial_odometer)
      end
      if @car.uses.where.not(refueling_amount: 0).count >= 2

SELECT "uses".* FROM "uses" WHERE "uses"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
    def set_use
      @use = Use.find(params[:id])

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 116], ["LIMIT", 1]]
SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
---
    def set_company_and_car
      @company = Company.find(params[:company_id])
      @car = Car.find(params[:car_id])