app/views/admin/managers/index.html.slim

SELECT "managers".* FROM "managers" WHERE "managers"."company_id" = $1  [["company_id", 67]]
---
    tbody
    - @company.managers.each do |manager|