app/views/manager/cars/_form.html.slim

        - borrower_array = []
        - @company.users.all.each do |user|
---
SELECT "users".* FROM "users" WHERE "users"."company_id" = $1  [["company_id", 42]]