app/views/manager/cars/index.html.slim

SELECT "inspections".* FROM "inspections" WHERE "inspections"."car_id" = $1  [["car_id", 7]]
SELECT "inspections".* FROM "inspections" WHERE "inspections"."car_id" = $1 ORDER BY "inspections"."id" DESC LIMIT $2  [["car_id", 7], ["LIMIT", 1]]
---
          td.align-middle.text-center
            - if car.inspections.present?
              = l car.inspections.order(:id).last.limit, format: :default

SELECT "uses".* FROM "uses" WHERE "uses"."car_id" = $1 AND "uses"."wash" = $2  [["car_id", 7], ["wash", "有"]]
SELECT "uses".* FROM "uses" WHERE "uses"."car_id" = $1 AND "uses"."wash" = $2 ORDER BY "uses"."id" DESC LIMIT $3  [["car_id", 7], ["wash", "有"], ["LIMIT", 1]]
---
          td.align-middle.text-center
            - if car.uses.where(wash: "有").present?
              = l car.uses.where(wash: "有").order(:id).last.use_day, format: :short
              | 実施
              - if (Date.today - car.uses.where(wash: "有").order(:id).last.use_day) > 30

SELECT "uses".* FROM "uses" WHERE "uses"."car_id" = $1 AND "uses"."oil_change" = $2  [["car_id", 7], ["oil_change", "有"]]
SELECT "uses".* FROM "uses" WHERE "uses"."car_id" = $1 AND "uses"."oil_change" = $2 ORDER BY "uses"."id" DESC LIMIT $3  [["car_id", 7], ["oil_change", "有"], ["LIMIT", 1]]
---
          td.align-middle.text-center
            - if car.uses.where(oil_change: "有").present?
              = (car.oil_frequency - (car.uses.last.odometer - car.uses.where(oil_change: "有").last.odometer)).to_s(:delimited)
              |  km走行可能
              - if (car.uses.order(:id).last.odometer - car.uses.where(oil_change: "有").order(:id).last.odometer) > car.oil_frequency