app/views/manager/cars/show.html.slim

SELECT "uses".* FROM "uses" WHERE "uses"."car_id" = $1  [["car_id", 18]]
---
        td.align-middle.text-center
          - if @car.uses.present?

SELECT COUNT(*) FROM "uses" WHERE "uses"."car_id" = $1 AND "uses"."refueling_amount" != $2  [["car_id", 18], ["refueling_amount", 0.0]]
---
        td.align-middle.text-center
          - if @car.uses.where.not(refueling_amount: 0).count >=2

SELECT "inspections".* FROM "inspections" WHERE "inspections"."car_id" = $1  [["car_id", 18]]
---
        td.align-middle.text-center
          - if @car.inspections.present?

SELECT "uses".* FROM "uses" WHERE "uses"."car_id" = $1 AND "uses"."wash" = $2  [["car_id", 18], ["wash", "有"]]
---
        td.align-middle.text-center
          - if @car.uses.where(wash: "有").present?

SELECT "uses".* FROM "uses" WHERE "uses"."car_id" = $1 AND "uses"."oil_change" = $2  [["car_id", 18], ["oil_change", "有"]]
---
        td.align-middle.text-center
          - if @car.uses.where(oil_change: "有").present?