app/views/status/_car_status.slim

  td.px-0.py-1.font-weight-bold
    - min_reservation = car.reservations.where("reservation_day >= ?", Date.today).sort_by{|reservation| (Date.today - reservation.reservation_day).abs}.first
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."car_id" = $1 AND (reservation_day >= '2020-07-17')  [["car_id", 47]]

    - st = ''
    - if car.uses.count >= 1
---
SELECT COUNT(*) FROM "uses" WHERE "uses"."car_id" = $1  [["car_id", 47]]