app/controllers/application_controller.rb

  def after_sign_in_path_for(resource)
    case resource
    when Admin
      admin_companies_path
    when Manager
      company_manager_cars_path(Company.find(current_manager.company_id))
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def check_manager_company
    if Company.last.id >= params[:company_id].to_i
      unless Company.find(params[:company_id]) === current_manager.company
---
SELECT "companies".* FROM "companies" ORDER BY "companies"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]