app/controllers/reservations_controller.rb

  def create
    @reservation = @car.reservations.build(reservation_params)
    if @reservation.save
---
INSERT INTO "reservations" ("reservation_day", "user_id", "car_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["reservation_day", "2020-07-15"], ["user_id", 24], ["car_id", 44], ["created_at", "2020-07-17 16:15:17.182713"], ["updated_at", "2020-07-17 16:15:17.182713"]]

  def destroy
    @reservation.destroy
---
DELETE FROM "reservations" WHERE "reservations"."id" = $1  [["id", 4]]

    def set_company_and_car
      @company = Company.find(params[:company_id])
      @car = Car.find(params[:car_id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 98], ["LIMIT", 1]]
SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 46], ["LIMIT", 1]]