app/controllers/status_controller.rb

  def index
    @cars = @company.cars.order(created_at: :desc)
---
SELECT "cars".* FROM "cars" WHERE "cars"."company_id" = $1 ORDER BY "cars"."created_at" DESC  [["company_id", 100]]

    def set_company
      @company = Company.find(params[:company_id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 100], ["LIMIT", 1]]