app/models/use.rb

SELECT "uses".* FROM "uses" WHERE "uses"."car_id" = $1 AND (use_day > '2020-01-22')  [["car_id", 1]]
---
  def newer_than_previous
    if use_day.present? and Use.where(car_id: car_id).where('use_day > ?', use_day).present?

SELECT "uses".* FROM "uses" WHERE "uses"."car_id" = $1  [["car_id", 1]]
SELECT "uses".* FROM "uses" WHERE "uses"."car_id" = $1 ORDER BY "uses"."id" DESC LIMIT $2  [["car_id", 1], ["LIMIT", 1]]
---
  def larger_than_previous
    if odometer.present? and Use.where(car_id: car_id).present?
      if Use.where(car_id: car.id).order(:id).last.odometer > odometer