app/views/manager/uses/_form.html.slim

SELECT "users".* FROM "users" WHERE "users"."company_id" = $1  [["company_id", 111]]
---
      .col-7
        = form.select :user_id, @company.users.collect {|u| [u.user_name, u.id]}
  .field
    .row
      .col-5

SELECT "uses".* FROM "uses" WHERE "uses"."car_id" = $1 ORDER BY "uses"."id" ASC LIMIT $2  [["car_id", 52], ["LIMIT", 1]]
---
        - if @use.id.present?
          - if @use.id == @car.uses.order(:id).first.id

SELECT "uses".* FROM "uses" WHERE "uses"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
SELECT COUNT(*) FROM "uses" WHERE "uses"."car_id" = $1  [["car_id", 49]]
---
          - else
            | (ひとつ前 #{@car.uses.where('id < ?', @use.id).order(:id).last.odometer})
        - else
          - if @car.uses.count > 0