app/views/manager/uses/index.html.slim

SELECT "uses".* FROM "uses" WHERE "uses"."car_id" = $1 ORDER BY "uses"."created_at" DESC  [["car_id", 48]]
---
      - @uses.each do |use|
        - last_use = @car.uses.where("id < #{use.id}").last